[Setting]
Language=简体中文
MainSoftWareInfo = CH347 高速编程器

[FileMenu]
File     = 文件
Open     = 打开
Save     = 保存
SaveAs   = 另存为
FileComb = 文件合并
Close    = 退出
[BufferMenu]
Buffer   = 缓冲区
Fill     = 填充
Find     = 查找
FindNext = 查找下一个
Jump     = 跳转

[ProgramMenu]
Program    = 编程操作
Auto       = 自动
BlankCheck = 查空
Erase      = 擦除
Write      = 写入
Read       = 读出
Verify     = 校验
Mass      = 批量烧录
ChipCheck  = 芯片检测
AutoSel    = 自动选项

BtnAuto       = 自动
BtnBlankCheck = 查空
BtnErase      = 擦除
BtnWrite      = 写入
BtnRead       = 读出
BtnVerify     = 校验
BtnMass       = 批量
BtnStop       = 停止
BtnChipCheck  = 检测
BtnChipFind   = 查找

[ProjectMenu]
Project    = 工程
Open       = 打开
Save       = 保存
Offline    = 离线工程

[HardMenu]
HardWare   = 硬件
HardInfo   = 硬件信息
FirmUpdate = 固件更新
ChipDb     = 芯片库管理
SelfCheck  = 自检

[LanguageMenu]
Language    = 语言

[AboutMenu]
Device      = 设备
About       = 关于

[HelpMenu]
Help        = 帮助

[ChipInfo]
Chip        = 芯片
ChipType    = 类型：
Manauf      = 厂商：
ChipName    = 芯片名称：
ChipInfo    = 芯片信息
ChipCap     = 容量：
PageSize    = 页大小：
OtpSize     = OTP大小：
Voltage     = 芯片电压：
ChipChnTitle = 烧录模式
ChipChn1    = 普通模式
ChipChn2    = 一拖二模式
ChipChn3    = SOP16烧录

[Button]
OK            = 确定
Cancel        = 取消
Select        = 选择

[FileInport]
ODTitle                = 选择打开的文件
FileInportTitle        = 文件导入缓存区编辑
BufferStartAddr        = 缓存区起始地址(HEX)：

[BufferFill]
FillDialogTitle        = 缓冲区填充设置
FillStartAddr          = 起始地址(HEX):
FillLen                = 填充长度(HEX):
FillValue              = 填充数值(HEX):
FillRandom             = 随机填充

[BufferFind]
BufferFindTitle        = 查找缓冲区
BufferFindValue        = 查找内容(HEX):

[BufferJump]
BufferJumpTitle        = 缓冲区跳转
BufferJumpAddr         = 跳转地址(HEX):
BufferCurrentAddr      = 当前地址(HEX):

[AutoSel]
AutoSelTitle           = 自动选项
AutoSelIDCheck         = ID校验
AutoSelErase           = 擦除
AutoSelWrite           = 写入
AutoSelVerify          = 校验

[HardInfo]
HardInfoTitle           = 硬件信息
DevName                 = 设备名：
HardVersion             = 硬件版本：
SoftWareVersion         = 固件版本：
DevSN                   = 序列号：

[FirmUpdate]
ODTitle                 = 选择固件升级文件
FirmPageTitle           = 固件版本更新
StartButton             = 启动更新


[Log]
LogStaSuccess           = 成功！
LogStaError             = 错误！
LogFileOpen             = 打开文件，文件名：
LogFileSave             = 保存文件，文件名：
LogFileSaveAs           = 文件另存为：

LogOperatTimeTitle      = 共耗时
LogOperatTime           = 秒

LogChipCheckOK          = 检测芯片，芯片名为：
LogChipCheckCommError   = 检测芯片，通讯错误.
LogChipCheckError       = 检测芯片，未检测到芯片.

LogChipErase            = 正在擦除芯片......
LogChipEraseChipErr     = 擦除错误！请先选择芯片型号！
LogChipEraseCommError   = 擦除通讯错误，请重试.
LogChipEraseSuccess     = 擦除完成.耗时

LogChipWrite            = 正在写入数据......
LogChipWriteChipErr     = 写入错误！请先选择芯片型号！
LogChipWriteCommError   = 写入通讯错误，请重试.
LogChipWriteFileError   = 写入芯片，错误！请先打开一个文件！
LogChipWriteFileName    = 写入芯片，
LogChipWriteFileLen     = 写入长度：
LogChipWriteSuccess     = 写入完成.耗时

LogChipReadChip         = 正在读取......
LogChipReadSuccess      = 读取芯片，完成！耗时
LogChipReadError        = 读取错误，请重试！


LogChipVerifyChip       = 正在校验......
LogChipVerifySuccess    = 校验芯片，成功！耗时
LogChipVerifyError      = 校验错误，请重试！

DevConStaOnline         = 设备已连接
DevConStaOffline        = 设备离线
DevConVersion           = 设备版本：
DevConLogDevice         = 检测到编程器，型号：
DevConLogSN             = 产品序列号：


LogChipBankCheck        =  查空操作.
LogChipBankTrue         =  该芯片是空的，可以直接写入.
LogChipBankFalse        =  该芯片不是空的，请擦除后再写入.

LogChipDetect           = 检测并识别到芯片，型号：
LogChipDetectCapcity    = 容量：
LogChipDetectID         = 芯片ID：
LogChipDetectUnknown    = 检测到芯片，但未识别出芯片型号.芯片ID：
LogChipDetectError      = 芯片检测异常.
LogChipDetectNULL       = 未检测到芯片.
LogChipSelect           = 手动选择芯片成功，型号：


LogChipMassStart        = 批量烧录开始，请点击”停止“按钮停止.
LogChipMassStop         = 批量烧录已停止，将在本次烧录完成后停止.
LogChipMassAutoStop     = 30秒内没有检测到芯片，已自动停止了批量烧录.



